Ran Plan for 2 projects:

1. dir: `.` workspace: `stage`
1. dir: `.` workspace: `prod`
---

### 1. dir: `.` workspace: `stage`
<details><summary>Show Output</summary>

```diff
Run plan on stage


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # yandex_vpc_subnet.subnet-d will be created
+ resource "yandex_vpc_subnet" "subnet-d" {
      + created_at     = (known after apply)
      + folder_id      = "b1gge1m2ng2nlr4df7bo"
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "subnet-d-stage"
      + network_id     = "enp0m75k03q8rug3uagg"
      + v4_cidr_blocks = [
          + "192.168.6.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-d"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
Releasing state lock. This may take a few moments...
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -w stage
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis-0:4141/lock?id=owirtifo%252Fapp-netology-repo%252F.%252Fstage)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -w stage
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 2. dir: `.` workspace: `prod`
<details><summary>Show Output</summary>

```diff
Run plan on prod

data.terraform_remote_state.default: Reading...
data.terraform_remote_state.default: Read complete after 0s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_file.inventory will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "inventory" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<-EOT
            [all]
            ${connection_strings_master}
            ${connection_strings_worker}
            
            [all:vars]
            #supplementary_addresses_in_ssl_keys='["84.201.153.255","84.201.180.43","84.201.174.174"]'
            
            [kube-master]
            ${list_masters}
            
            [etcd]
            ${list_masters}
            
            [kube-node]
            ${list_workers}
            
            [k8s-cluster:children]
            kube-master
            kube-node
        EOT
      + vars     = {
          + "connection_master"         = (known after apply)
          + "connection_strings_master" = (known after apply)
          + "connection_strings_worker" = (known after apply)
          + "list_masters"              = (known after apply)
          + "list_workers"              = (known after apply)
        }
    }

  # null_resource.inventories will be created
+ resource "null_resource" "inventories" {
      + id       = (known after apply)
      + triggers = {
          + "template" = (known after apply)
        }
    }

  # yandex_compute_instance_group.k8s-masters will be created
+ resource "yandex_compute_instance_group" "k8s-masters" {
      + created_at          = (known after apply)
      + deletion_protection = false
      + folder_id           = "b1gge1m2ng2nlr4df7bo"
      + id                  = (known after apply)
      + instances           = (known after apply)
      + name                = "k8s-masters-prod"
      + service_account_id  = "ajek96hd6ch3b3ci5i9d"
      + status              = (known after apply)

      + allocation_policy {
          + zones = [
              + "ru-central1-a",
              + "ru-central1-b",
            ]
        }

      + deploy_policy {
          + max_creating     = 0
          + max_deleting     = 0
          + max_expansion    = 0
          + max_unavailable  = 1
          + startup_duration = 0
          + strategy         = "opportunistic"
        }

      + instance_template {
          + labels      = (known after apply)
          + metadata    = {
              + "ssh-keys" = <<-EOT
                    ubuntu:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCtI45qoowzP63YXhapWbYleoPDDsDWxENGkUFR+aSCu0AO87+GENRSLnTKnj5f4THr3NJ2ahgKU3ubqu16I/l3F2GK7Pij9UlBwSfdy0fp6OxE8HswCqoB1KgFmmBhD/K8ACbyL/9KaeXFaj3Qot8wQyxPXBdIjKtwgHgxiBrwSUP1YvHGM+OF9kavYoZyKgzFKTxFsOfXy1j4vE948M/18Fq2Vo3RkSTRlU9GcGK0/VWTDBdfAIZDrvycZ3kqGQjEs3XHFSbTcXIN6A1b06N00iZwiYjT1Q1pe9Jh6Ep9QdGkMsi8w/qJ3LqXcSFE8qkjI18EpqlKMIWpjJHGRqhHTBxGd/NZzBAF9cHCYbUMXLktbeewAQH8xifZPs6Ry5x6rL7Qj31TyzSUKqSbHERgVjkVQis1fgFd3fIn+/M4bM4hlh5Jv41vzZoK0FFSx3tAIo25bb+B6HA9hfac55ojuykTVLJ5NHxJXRh8l3GtaRiB8JFXFJkeF5iyY0bJglDlcdAcWgpe2zAYuchex21q/w/NxA0fG4dVWmNm3GOhBhd+P2pEtAlT4XoHFtuQsHqjJafzp4mB1NFpOir8Ks9nVJknjouLyKdg51YbQh8a26pmeZRxaGaE/4KwKMfZrNzvkSCoJEsyGe3xk1yAKcJMyOjV9K8pHqdVmXsnN2FY8w== root@ansible
                EOT
            }
          + name        = "master-{instance.index}-prod"
          + platform_id = "standard-v2"

          + boot_disk {
              + device_name = (known after apply)
              + mode        = "READ_WRITE"

              + initialize_params {
                  + image_id    = "fd80bm0rh4rkepi5ksdi"
                  + size        = 50
                  + snapshot_id = (known after apply)
                  + type        = "network-hdd"
                }
            }

          + metadata_options (known after apply)

          + network_interface {
              + ip_address   = (known after apply)
              + ipv4         = true
              + ipv6         = (known after apply)
              + ipv6_address = (known after apply)
              + nat          = true
              + network_id   = (known after apply)
              + subnet_ids   = (known after apply)
            }

          + resources {
              + core_fraction = 100
              + cores         = 2
              + memory        = 2
            }

          + scheduling_policy {
              + preemptible = false
            }
        }

      + scale_policy {
          + fixed_scale {
              + size = 3
            }
        }
    }

  # yandex_compute_instance_group.k8s-workers will be created
+ resource "yandex_compute_instance_group" "k8s-workers" {
      + created_at          = (known after apply)
      + deletion_protection = false
      + folder_id           = "b1gge1m2ng2nlr4df7bo"
      + id                  = (known after apply)
      + instances           = (known after apply)
      + name                = "k8s-workers-prod"
      + service_account_id  = "ajek96hd6ch3b3ci5i9d"
      + status              = (known after apply)

      + allocation_policy {
          + zones = [
              + "ru-central1-a",
              + "ru-central1-b",
            ]
        }

      + deploy_policy {
          + max_creating     = 0
          + max_deleting     = 0
          + max_expansion    = 0
          + max_unavailable  = 1
          + startup_duration = 0
          + strategy         = "opportunistic"
        }

      + instance_template {
          + labels      = (known after apply)
          + metadata    = {
              + "ssh-keys" = <<-EOT
                    ubuntu:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCtI45qoowzP63YXhapWbYleoPDDsDWxENGkUFR+aSCu0AO87+GENRSLnTKnj5f4THr3NJ2ahgKU3ubqu16I/l3F2GK7Pij9UlBwSfdy0fp6OxE8HswCqoB1KgFmmBhD/K8ACbyL/9KaeXFaj3Qot8wQyxPXBdIjKtwgHgxiBrwSUP1YvHGM+OF9kavYoZyKgzFKTxFsOfXy1j4vE948M/18Fq2Vo3RkSTRlU9GcGK0/VWTDBdfAIZDrvycZ3kqGQjEs3XHFSbTcXIN6A1b06N00iZwiYjT1Q1pe9Jh6Ep9QdGkMsi8w/qJ3LqXcSFE8qkjI18EpqlKMIWpjJHGRqhHTBxGd/NZzBAF9cHCYbUMXLktbeewAQH8xifZPs6Ry5x6rL7Qj31TyzSUKqSbHERgVjkVQis1fgFd3fIn+/M4bM4hlh5Jv41vzZoK0FFSx3tAIo25bb+B6HA9hfac55ojuykTVLJ5NHxJXRh8l3GtaRiB8JFXFJkeF5iyY0bJglDlcdAcWgpe2zAYuchex21q/w/NxA0fG4dVWmNm3GOhBhd+P2pEtAlT4XoHFtuQsHqjJafzp4mB1NFpOir8Ks9nVJknjouLyKdg51YbQh8a26pmeZRxaGaE/4KwKMfZrNzvkSCoJEsyGe3xk1yAKcJMyOjV9K8pHqdVmXsnN2FY8w== root@ansible
                EOT
            }
          + name        = "worker-{instance.index}-prod"
          + platform_id = "standard-v2"

          + boot_disk {
              + device_name = (known after apply)
              + mode        = "READ_WRITE"

              + initialize_params {
                  + image_id    = "fd80bm0rh4rkepi5ksdi"
                  + size        = 100
                  + snapshot_id = (known after apply)
                  + type        = "network-hdd"
                }
            }

          + metadata_options (known after apply)

          + network_interface {
              + ip_address   = (known after apply)
              + ipv4         = true
              + ipv6         = (known after apply)
              + ipv6_address = (known after apply)
              + nat          = true
              + network_id   = (known after apply)
              + subnet_ids   = (known after apply)
            }

          + resources {
              + core_fraction = 100
              + cores         = 2
              + memory        = 2
            }

          + scheduling_policy {
              + preemptible = false
            }
        }

      + scale_policy {
          + fixed_scale {
              + size = 3
            }
        }
    }

  # yandex_lb_network_load_balancer.k8s-nlb will be created
+ resource "yandex_lb_network_load_balancer" "k8s-nlb" {
      + allow_zonal_shift   = (known after apply)
      + created_at          = (known after apply)
      + deletion_protection = false
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + name                = "k8s-nlb"
      + region_id           = (known after apply)
      + type                = "external"

      + attached_target_group {
          + target_group_id = (known after apply)

          + healthcheck {
              + healthy_threshold   = 2
              + interval            = 2
              + name                = "tcp"
              + timeout             = 1
              + unhealthy_threshold = 2

              + tcp_options {
                  + port = 32443
                }
            }
        }

      + listener {
          + name        = "app-listener"
          + port        = 443
          + protocol    = "tcp"
          + target_port = 32443

          + external_address_spec {
              + address    = (known after apply)
              + ip_version = "ipv4"
            }
        }
    }

  # yandex_lb_target_group.ntlg-tgroup will be created
+ resource "yandex_lb_target_group" "ntlg-tgroup" {
      + created_at = (known after apply)
      + folder_id  = (known after apply)
      + id         = (known after apply)
      + name       = "ntlg-tgroup"
      + region_id  = "ru-central1"

      + target (known after apply)
    }

  # yandex_vpc_network.netology-vpc will be created
+ resource "yandex_vpc_network" "netology-vpc" {
      + created_at                = (known after apply)
      + default_security_group_id = (known after apply)
      + folder_id                 = "b1gge1m2ng2nlr4df7bo"
      + id                        = (known after apply)
      + labels                    = (known after apply)
      + name                      = "netology-vpc-prod"
      + subnet_ids                = (known after apply)
    }

  # yandex_vpc_subnet.subnet-a will be created
+ resource "yandex_vpc_subnet" "subnet-a" {
      + created_at     = (known after apply)
      + folder_id      = "b1gge1m2ng2nlr4df7bo"
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "subnet-a-prod"
      + network_id     = (known after apply)
      + v4_cidr_blocks = [
          + "192.168.1.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-a"
    }

  # yandex_vpc_subnet.subnet-b will be created
+ resource "yandex_vpc_subnet" "subnet-b" {
      + created_at     = (known after apply)
      + folder_id      = "b1gge1m2ng2nlr4df7bo"
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "subnet-b-prod"
      + network_id     = (known after apply)
      + v4_cidr_blocks = [
          + "192.168.2.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-b"
    }

  # yandex_vpc_subnet.subnet-d will be created
+ resource "yandex_vpc_subnet" "subnet-d" {
      + created_at     = (known after apply)
      + folder_id      = "b1gge1m2ng2nlr4df7bo"
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "subnet-d-prod"
      + network_id     = (known after apply)
      + v4_cidr_blocks = [
          + "192.168.3.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-d"
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ instance_group_masters_private_ips = (known after apply)
+ instance_group_masters_public_ips  = (known after apply)
+ instance_group_workers_private_ips = (known after apply)
+ instance_group_workers_public_ips  = (known after apply)
+ nlb_ip_address                     = [
      + [
          + {
              + address    = (known after apply)
              + ip_version = "ipv4"
            },
        ],
    ]
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -w prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis-0:4141/lock?id=owirtifo%252Fapp-netology-repo%252F.%252Fprod)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -w prod
  ```
Plan: 9 to add, 0 to change, 0 to destroy.

---
### Plan Summary

2 projects, 2 with changes, 0 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```